Every-Flavor-Robotics/motorgo-arduino/board_definitions/motorgo_1.0/boards.txt
motorgomini_v1_r1.menu.CPUFreq.240=240MHz (WiFi)
motorgomini_v1_r1.menu.CPUFreq.240.build.f_cpu=240000000L
motorgomini_v1_r1.menu.CPUFreq.160=160MHz (WiFi)
motorgomini_v1_r1.menu.CPUFreq.160.build.f_cpu=160000000L
motorgomini_v1_r1.menu.CPUFreq.80=80MHz (WiFi)
motorgomini_v1_r1.menu.CPUFreq.80.build.f_cpu=80000000L
motorgomini_v1_r1.menu.CPUFreq.40=40MHz
motorgomini_v1_r1.menu.CPUFreq.40.build.f_cpu=40000000L
motorgomini_v1_r1.menu.CPUFreq.20=20MHz
motorgomini_v1_r1.menu.CPUFreq.20.build.f_cpu=20000000L
motorgomini_v1_r1.menu.CPUFreq.10=10MHz
motorgomini_v1_r1.menu.CPUFreq.10.build.f_cpu=10000000L

motorgomini_v1_r1.menu.UploadSpeed.921600=921600
motorgomini_v1_r1.menu.UploadSpeed.921600.upload.speed=921600
motorgomini_v1_r1.menu.UploadSpeed.115200=115200
motorgomini_v1_r1.menu.UploadSpeed.115200.upload.speed=115200
motorgomini_v1_r1.menu.UploadSpeed.256000.windows=256000
motorgomini_v1_r1.menu.UploadSpeed.256000.upload.speed=256000
motorgomini_v1_r1.menu.UploadSpeed.230400.windows.upload.speed=256000
motorgomini_v1_r1.menu.UploadSpeed.230400=230400
motorgomini_v1_r1.menu.UploadSpeed.230400.upload.speed=230400
motorgomini_v1_r1.menu.UploadSpeed.460800.linux=460800
motorgomini_v1_r1.menu.UploadSpeed.460800.macosx=460800
motorgomini_v1_r1.menu.UploadSpeed.460800.upload.speed=460800
motorgomini_v1_r1.menu.UploadSpeed.512000.windows=512000
motorgomini_v1_r1.menu.UploadSpeed.512000.upload.speed=512000

motorgomini_v1_r1.menu.DebugLevel.none=None
motorgomini_v1_r1.menu.DebugLevel.none.build.code_debug=0
motorgomini_v1_r1.menu.DebugLevel.error=Error
motorgomini_v1_r1.menu.DebugLevel.error.build.code_debug=1
motorgomini_v1_r1.menu.DebugLevel.warn=Warn
motorgomini_v1_r1.menu.DebugLevel.warn.build.code_debug=2
motorgomini_v1_r1.menu.DebugLevel.info=Info
motorgomini_v1_r1.menu.DebugLevel.info.build.code_debug=3
motorgomini_v1_r1.menu.DebugLevel.debug=Debug
motorgomini_v1_r1.menu.DebugLevel.debug.build.code_debug=4
motorgomini_v1_r1.menu.DebugLevel.verbose=Verbose
motorgomini_v1_r1.menu.DebugLevel.verbose.build.code_debug=5

motorgomini_v1_r1.menu.EraseFlash.none=Disabled
motorgomini_v1_r1.menu.EraseFlash.none.upload.erase_cmd=
motorgomini_v1_r1.menu.EraseFlash.all=Enabled
motorgomini_v1_r1.menu.EraseFlash.all.upload.erase_cmd=-e



##############################################################

##############################################################

motorgomini_v1_r2.name=MotorGo Mini V1 Rev2 (ESP32-S3)
motorgomini_v1_r2.vid.0=0x303a
motorgomini_v1_r2.pid.0=0x1001

motorgomini_v1_r2.bootloader.tool=esptool_py
motorgomini_v1_r2.bootloader.tool.default=esptool_py

motorgomini_v1_r2.upload.tool=esptool_py
motorgomini_v1_r2.upload.tool.default=esptool_py
motorgomini_v1_r2.upload.tool.network=esp_ota

motorgomini_v1_r2.upload.maximum_size=1310720
motorgomini_v1_r2.upload.maximum_data_size=327680
motorgomini_v1_r2.upload.flags=
motorgomini_v1_r2.upload.extra_flags=
motorgomini_v1_r2.upload.use_1200bps_touch=false
motorgomini_v1_r2.upload.wait_for_upload_port=false

motorgomini_v1_r2.serial.disableDTR=false
motorgomini_v1_r2.serial.disableRTS=false

motorgomini_v1_r2.build.tarch=xtensa
motorgomini_v1_r2.build.bootloader_addr=0x0
motorgomini_v1_r2.build.target=esp32s3
motorgomini_v1_r2.build.mcu=esp32s3
motorgomini_v1_r2.build.core=esp32
motorgomini_v1_r2.build.variant=motorgomini_v1_r2
motorgomini_v1_r2.build.board=MOTORGOMINI_V1_R2

motorgomini_v1_r2.build.usb_mode=1
motorgomini_v1_r2.build.cdc_on_boot=1
motorgomini_v1_r2.build.msc_on_boot=0
motorgomini_v1_r2.build.dfu_on_boot=0
motorgomini_v1_r2.build.f_cpu=240000000L
motorgomini_v1_r2.build.flash_size=4MB
motorgomini_v1_r2.build.flash_freq=80m
motorgomini_v1_r2.build.flash_mode=dio
motorgomini_v1_r2.build.boot=qio
motorgomini_v1_r2.build.boot_freq=80m
motorgomini_v1_r2.build.partitions=default
motorgomini_v1_r2.build.defines=
motorgomini_v1_r2.build.loop_core=
motorgomini_v1_r2.build.event_core=
motorgomini_v1_r2.build.psram_type=qspi
motorgomini_v1_r2.build.memory_type={build.boot}_{build.psram_type}


## IDE 2.0 Seems to not update the value
motorgomini_v1_r2.menu.JTAGAdapter.default=Disabled
motorgomini_v1_r2.menu.JTAGAdapter.default.build.copy_jtag_files=0
motorgomini_v1_r2.menu.JTAGAdapter.builtin=Integrated USB JTAG
motorgomini_v1_r2.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
motorgomini_v1_r2.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
motorgomini_v1_r2.menu.JTAGAdapter.external=FTDI Adapter
motorgomini_v1_r2.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
motorgomini_v1_r2.menu.JTAGAdapter.external.build.copy_jtag_files=1
motorgomini_v1_r2.menu.JTAGAdapter.bridge=ESP USB Bridge
motorgomini_v1_r2.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
motorgomini_v1_r2.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

motorgomini_v1_r2.menu.PSRAM.disabled=Disabled
motorgomini_v1_r2.menu.PSRAM.disabled.build.defines=
motorgomini_v1_r2.menu.PSRAM.disabled.build.psram_type=qspi
motorgomini_v1_r2.menu.PSRAM.enabled=QSPI PSRAM
motorgomini_v1_r2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
motorgomini_v1_r2.menu.PSRAM.enabled.build.psram_type=qspi
motorgomini_v1_r2.menu.PSRAM.opi=OPI PSRAM
motorgomini_v1_r2.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
motorgomini_v1_r2.menu.PSRAM.opi.build.psram_type=opi

motorgomini_v1_r2.menu.FlashMode.qio=QIO 80MHz
motorgomini_v1_r2.menu.FlashMode.qio.build.flash_mode=dio
motorgomini_v1_r2.menu.FlashMode.qio.build.boot=qio
motorgomini_v1_r2.menu.FlashMode.qio.build.boot_freq=80m
motorgomini_v1_r2.menu.FlashMode.qio.build.flash_freq=80m
motorgomini_v1_r2.menu.FlashMode.qio120=QIO 120MHz
motorgomini_v1_r2.menu.FlashMode.qio120.build.flash_mode=dio
motorgomini_v1_r2.menu.FlashMode.qio120.build.boot=qio
motorgomini_v1_r2.menu.FlashMode.qio120.build.boot_freq=120m
motorgomini_v1_r2.menu.FlashMode.qio120.build.flash_freq=80m
motorgomini_v1_r2.menu.FlashMode.dio=DIO 80MHz
motorgomini_v1_r2.menu.FlashMode.dio.build.flash_mode=dio
motorgomini_v1_r2.menu.FlashMode.dio.build.boot=dio
motorgomini_v1_r2.menu.FlashMode.dio.build.boot_freq=80m
motorgomini_v1_r2.menu.FlashMode.dio.build.flash_freq=80m
motorgomini_v1_r2.menu.FlashMode.opi=OPI 80MHz
motorgomini_v1_r2.menu.FlashMode.opi.build.flash_mode=dout
motorgomini_v1_r2.menu.FlashMode.opi.build.boot=opi
motorgomini_v1_r2.menu.FlashMode.opi.build.boot_freq=80m
motorgomini_v1_r2.menu.FlashMode.opi.build.flash_freq=80m

