Every-Flavor-Robotics/motorgo-arduino/board_definitions/motorgo_1.0/boards.txt
##############################################################

motorgomini_v2_r1.name=MotorGo Mini V2 Rev1 (ESP32-S3)
motorgomini_v2_r1.vid.0=0x303a
motorgomini_v2_r1.pid.0=0x1001

motorgomini_v2_r1.bootloader.tool=esptool_py
motorgomini_v2_r1.bootloader.tool.default=esptool_py

motorgomini_v2_r1.upload.tool=esptool_py
motorgomini_v2_r1.upload.tool.default=esptool_py
motorgomini_v2_r1.upload.tool.network=esp_ota

motorgomini_v2_r1.upload.maximum_size=1310720
motorgomini_v2_r1.upload.maximum_data_size=327680
motorgomini_v2_r1.upload.flags=
motorgomini_v2_r1.upload.extra_flags=
motorgomini_v2_r1.upload.use_1200bps_touch=false
motorgomini_v2_r1.upload.wait_for_upload_port=false

motorgomini_v2_r1.serial.disableDTR=false
motorgomini_v2_r1.serial.disableRTS=false

motorgomini_v2_r1.build.tarch=xtensa
motorgomini_v2_r1.build.bootloader_addr=0x0
motorgomini_v2_r1.build.target=esp32s3
motorgomini_v2_r1.build.mcu=esp32s3
motorgomini_v2_r1.build.core=esp32
motorgomini_v2_r1.build.variant=motorgomini_v2_r1
motorgomini_v2_r1.build.board=MOTORGOMINI_V2_R1

motorgomini_v2_r1.build.usb_mode=1
motorgomini_v2_r1.build.cdc_on_boot=1
motorgomini_v2_r1.build.msc_on_boot=0
motorgomini_v2_r1.build.dfu_on_boot=0
motorgomini_v2_r1.build.f_cpu=240000000L
motorgomini_v2_r1.build.flash_size=4MB
motorgomini_v2_r1.build.flash_freq=80m
motorgomini_v2_r1.build.flash_mode=dio
motorgomini_v2_r1.build.boot=qio
motorgomini_v2_r1.build.boot_freq=80m
motorgomini_v2_r1.build.partitions=default
motorgomini_v2_r1.build.defines=
motorgomini_v2_r1.build.loop_core=
motorgomini_v2_r1.build.event_core=
motorgomini_v2_r1.build.psram_type=qspi
motorgomini_v2_r1.build.memory_type={build.boot}_{build.psram_type}


## IDE 2.0 Seems to not update the value
motorgomini_v2_r1.menu.JTAGAdapter.default=Disabled
motorgomini_v2_r1.menu.JTAGAdapter.default.build.copy_jtag_files=0
motorgomini_v2_r1.menu.JTAGAdapter.builtin=Integrated USB JTAG
motorgomini_v2_r1.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
motorgomini_v2_r1.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
motorgomini_v2_r1.menu.JTAGAdapter.external=FTDI Adapter
motorgomini_v2_r1.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
motorgomini_v2_r1.menu.JTAGAdapter.external.build.copy_jtag_files=1
motorgomini_v2_r1.menu.JTAGAdapter.bridge=ESP USB Bridge
motorgomini_v2_r1.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
motorgomini_v2_r1.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

motorgomini_v2_r1.menu.PSRAM.disabled=Disabled
motorgomini_v2_r1.menu.PSRAM.disabled.build.defines=
motorgomini_v2_r1.menu.PSRAM.disabled.build.psram_type=qspi
motorgomini_v2_r1.menu.PSRAM.enabled=QSPI PSRAM
motorgomini_v2_r1.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
motorgomini_v2_r1.menu.PSRAM.enabled.build.psram_type=qspi
motorgomini_v2_r1.menu.PSRAM.opi=OPI PSRAM
motorgomini_v2_r1.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
motorgomini_v2_r1.menu.PSRAM.opi.build.psram_type=opi

motorgomini_v2_r1.menu.FlashMode.qio=QIO 80MHz
motorgomini_v2_r1.menu.FlashMode.qio.build.flash_mode=dio
motorgomini_v2_r1.menu.FlashMode.qio.build.boot=qio
motorgomini_v2_r1.menu.FlashMode.qio.build.boot_freq=80m
motorgomini_v2_r1.menu.FlashMode.qio.build.flash_freq=80m
motorgomini_v2_r1.menu.FlashMode.qio120=QIO 120MHz
motorgomini_v2_r1.menu.FlashMode.qio120.build.flash_mode=dio
motorgomini_v2_r1.menu.FlashMode.qio120.build.boot=qio
motorgomini_v2_r1.menu.FlashMode.qio120.build.boot_freq=120m
motorgomini_v2_r1.menu.FlashMode.qio120.build.flash_freq=80m
motorgomini_v2_r1.menu.FlashMode.dio=DIO 80MHz
motorgomini_v2_r1.menu.FlashMode.dio.build.flash_mode=dio
motorgomini_v2_r1.menu.FlashMode.dio.build.boot=dio
motorgomini_v2_r1.menu.FlashMode.dio.build.boot_freq=80m
motorgomini_v2_r1.menu.FlashMode.dio.build.flash_freq=80m
motorgomini_v2_r1.menu.FlashMode.opi=OPI 80MHz
motorgomini_v2_r1.menu.FlashMode.opi.build.flash_mode=dout
motorgomini_v2_r1.menu.FlashMode.opi.build.boot=opi
motorgomini_v2_r1.menu.FlashMode.opi.build.boot_freq=80m
motorgomini_v2_r1.menu.FlashMode.opi.build.flash_freq=80m

motorgomini_v2_r1.menu.FlashSize.4M=4MB (32Mb)
motorgomini_v2_r1.menu.FlashSize.4M.build.flash_size=4MB
motorgomini_v2_r1.menu.FlashSize.8M=8MB (64Mb)
motorgomini_v2_r1.menu.FlashSize.8M.build.flash_size=8MB
motorgomini_v2_r1.menu.FlashSize.8M.build.partitions=default_8MB
motorgomini_v2_r1.menu.FlashSize.16M=16MB (128Mb)
motorgomini_v2_r1.menu.FlashSize.16M.build.flash_size=16MB
#esp32s3.menu.FlashSize.32M=32MB (256Mb)
#esp32s3.menu.FlashSize.32M.build.flash_size=32MB

motorgomini_v2_r1.menu.LoopCore.1=Core 1
motorgomini_v2_r1.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
motorgomini_v2_r1.menu.LoopCore.0=Core 0
motorgomini_v2_r1.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

motorgomini_v2_r1.menu.EventsCore.1=Core 1
motorgomini_v2_r1.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
motorgomini_v2_r1.menu.EventsCore.0=Core 0
motorgomini_v2_r1.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

motorgomini_v2_r1.menu.USBMode.hwcdc=Hardware CDC and JTAG
motorgomini_v2_r1.menu.USBMode.hwcdc.build.usb_mode=1
motorgomini_v2_r1.menu.USBMode.default=USB-OTG (TinyUSB)
motorgomini_v2_r1.menu.USBMode.default.build.usb_mode=0

motorgomini_v2_r1.menu.CDCOnBoot.default=Enabled
motorgomini_v2_r1.menu.CDCOnBoot.default.build.cdc_on_boot=1
motorgomini_v2_r1.menu.CDCOnBoot.cdc=Disabled
motorgomini_v2_r1.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

motorgomini_v2_r1.menu.MSCOnBoot.default=Disabled
motorgomini_v2_r1.menu.MSCOnBoot.default.build.msc_on_boot=0
motorgomini_v2_r1.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
motorgomini_v2_r1.menu.MSCOnBoot.msc.build.msc_on_boot=1

motorgomini_v2_r1.menu.DFUOnBoot.default=Disabled
motorgomini_v2_r1.menu.DFUOnBoot.default.build.dfu_on_boot=0
motorgomini_v2_r1.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
motorgomini_v2_r1.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

motorgomini_v2_r1.menu.UploadMode.default=UART0 / Hardware CDC
motorgomini_v2_r1.menu.UploadMode.default.upload.use_1200bps_touch=false
motorgomini_v2_r1.menu.UploadMode.default.upload.wait_for_upload_port=false
motorgomini_v2_r1.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
motorgomini_v2_r1.menu.UploadMode.cdc.upload.use_1200bps_touch=true
motorgomini_v2_r1.menu.UploadMode.cdc.upload.wait_for_upload_port=true

