Every-Flavor-Robotics/motorgo-arduino/board_definitions/motorgo_1.0/boards.txt
motorgomini_v2_r1.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.default.build.partitions=default
motorgomini_v2_r1.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
motorgomini_v2_r1.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
motorgomini_v2_r1.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
motorgomini_v2_r1.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
motorgomini_v2_r1.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.minimal.build.partitions=minimal
motorgomini_v2_r1.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.no_ota.build.partitions=no_ota
motorgomini_v2_r1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
motorgomini_v2_r1.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
motorgomini_v2_r1.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
motorgomini_v2_r1.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
motorgomini_v2_r1.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
motorgomini_v2_r1.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
motorgomini_v2_r1.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
motorgomini_v2_r1.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
motorgomini_v2_r1.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
motorgomini_v2_r1.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.huge_app.build.partitions=huge_app
motorgomini_v2_r1.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
motorgomini_v2_r1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
motorgomini_v2_r1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
motorgomini_v2_r1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
motorgomini_v2_r1.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
motorgomini_v2_r1.menu.PartitionScheme.fatflash.build.partitions=ffat
motorgomini_v2_r1.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
motorgomini_v2_r1.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
motorgomini_v2_r1.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
motorgomini_v2_r1.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
motorgomini_v2_r1.menu.PartitionScheme.rainmaker=RainMaker
motorgomini_v2_r1.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
motorgomini_v2_r1.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

motorgomini_v2_r1.menu.CPUFreq.240=240MHz (WiFi)
motorgomini_v2_r1.menu.CPUFreq.240.build.f_cpu=240000000L
motorgomini_v2_r1.menu.CPUFreq.160=160MHz (WiFi)
motorgomini_v2_r1.menu.CPUFreq.160.build.f_cpu=160000000L
motorgomini_v2_r1.menu.CPUFreq.80=80MHz (WiFi)
motorgomini_v2_r1.menu.CPUFreq.80.build.f_cpu=80000000L
motorgomini_v2_r1.menu.CPUFreq.40=40MHz
motorgomini_v2_r1.menu.CPUFreq.40.build.f_cpu=40000000L
motorgomini_v2_r1.menu.CPUFreq.20=20MHz
motorgomini_v2_r1.menu.CPUFreq.20.build.f_cpu=20000000L
motorgomini_v2_r1.menu.CPUFreq.10=10MHz
motorgomini_v2_r1.menu.CPUFreq.10.build.f_cpu=10000000L

motorgomini_v2_r1.menu.UploadSpeed.921600=921600
motorgomini_v2_r1.menu.UploadSpeed.921600.upload.speed=921600
motorgomini_v2_r1.menu.UploadSpeed.115200=115200
motorgomini_v2_r1.menu.UploadSpeed.115200.upload.speed=115200
motorgomini_v2_r1.menu.UploadSpeed.256000.windows=256000
motorgomini_v2_r1.menu.UploadSpeed.256000.upload.speed=256000
motorgomini_v2_r1.menu.UploadSpeed.230400.windows.upload.speed=256000
motorgomini_v2_r1.menu.UploadSpeed.230400=230400
motorgomini_v2_r1.menu.UploadSpeed.230400.upload.speed=230400
motorgomini_v2_r1.menu.UploadSpeed.460800.linux=460800
motorgomini_v2_r1.menu.UploadSpeed.460800.macosx=460800
motorgomini_v2_r1.menu.UploadSpeed.460800.upload.speed=460800
motorgomini_v2_r1.menu.UploadSpeed.512000.windows=512000
motorgomini_v2_r1.menu.UploadSpeed.512000.upload.speed=512000

motorgomini_v2_r1.menu.DebugLevel.none=None
motorgomini_v2_r1.menu.DebugLevel.none.build.code_debug=0
motorgomini_v2_r1.menu.DebugLevel.error=Error
motorgomini_v2_r1.menu.DebugLevel.error.build.code_debug=1
motorgomini_v2_r1.menu.DebugLevel.warn=Warn
motorgomini_v2_r1.menu.DebugLevel.warn.build.code_debug=2
motorgomini_v2_r1.menu.DebugLevel.info=Info
motorgomini_v2_r1.menu.DebugLevel.info.build.code_debug=3
motorgomini_v2_r1.menu.DebugLevel.debug=Debug
motorgomini_v2_r1.menu.DebugLevel.debug.build.code_debug=4
motorgomini_v2_r1.menu.DebugLevel.verbose=Verbose
motorgomini_v2_r1.menu.DebugLevel.verbose.build.code_debug=5

motorgomini_v2_r1.menu.EraseFlash.none=Disabled
motorgomini_v2_r1.menu.EraseFlash.none.upload.erase_cmd=
motorgomini_v2_r1.menu.EraseFlash.all=Enabled
motorgomini_v2_r1.menu.EraseFlash.all.upload.erase_cmd=-e



##############################################################
